In [16]:
import pandas as pd

In [17]:
df = pd.read_csv('../../../../바탕 화면/Data/csv/Uriage.csv')

In [18]:
df.head()

## 정형화 작업 필요

      purchase_date item_name  item_price customer_name
0  2019-06-13 18:02       상품A       100.0           김가온
1  2019-07-13 13:05     상 품 S         NaN           김우찬
2  2019-05-11 19:42     상 품 a         NaN           김유찬
3  2019-02-12 23:40       상품Z      2600.0           김재현
4   2019-04-22 3:09       상품a         NaN           김강현

#### uriage 데이터의 문제점
1. item_name 대/소문자 문제
    - 대/소문자 통일
    - upper(), lower()
2. item_name 공백 존재
    - 공백 제거
    - strip(), replace()
3. 결측치

In [19]:
## item_name 문자를 모두 대문자로 변환
df2=df.copy()

In [22]:
## case1(반복문)
for i in range(len(df2)):
    df2.loc[i, 'item_name'] = df2.loc[i, 'item_name'].upper()

In [23]:

df2.head(3)

      purchase_date item_name  item_price customer_name
0  2019-06-13 18:02       상품A       100.0           김가온
1  2019-07-13 13:05     상 품 S         NaN           김우찬
2  2019-05-11 19:42     상 품 A         NaN           김유찬

In [25]:
# case2(map()함수 -> 1차원 자료형 데이터의 각 데이터 1 개씩 추출 후 작업)
## Base(python) : map(함수, 1차원 리스트명)
_list = [1,2,3,4]
# map(), lambda 결합
list((map(
    lambda x : x+1,
    _list
)
)

)
# map(), 일반 함수 결합
def change(x):
    return x+2
list(
    map(
        change,
        _list
    )
)

[3, 4, 5, 6]

#### lambda 함수
- 선언과 동시에 호출
    - lamda 매개변수명 : 실행이 될 코드
- 일반함수로 사용하기에 너무 간단한 작업에 사용